app/views/pages/host_dashboard.html.erb

		<% @rooms.each do |room| %>
			<% room.bookings.each do |booking| %>
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."room_id" = ?  [["room_id", 1]]