app/controllers/bookings_controller.rb

INSERT INTO "bookings" ("start_date", "end_date", "guest_number", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["start_date", Thu, 13 Apr 2017], ["end_date", Fri, 14 Apr 2017], ["guest_number", 1], ["room_id", 2], ["created_at", 2017-04-04 01:26:42 UTC], ["updated_at", 2017-04-04 01:26:42 UTC]]
---
  def create
    @booking = Booking.new(booking_params)
    @booking.user_id = current_user.id

    respond_to do |format|
      if @booking.save

UPDATE "bookings" SET "approved" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["approved", true], ["updated_at", 2017-04-04 02:14:07 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @booking.update(booking_params)

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_booking
      @booking = Booking.find(params[:id])