app/controllers/charges_controller.rb

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "transactions" ("amount", "user_id", "booking_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["amount", 0.1e6], ["user_id", 1], ["booking_id", 2], ["created_at", 2017-04-10 04:46:02 UTC], ["updated_at", 2017-04-10 04:46:02 UTC]]
---
  def create
    @booking = Booking.find(params[:id])
    # Amount in cents
    @amount = (@booking.room.price * 100).to_i

    customer = Stripe::Customer.create(
      :email => params[:stripeEmail],
      :source  => params[:stripeToken]
    )

    charge = Stripe::Charge.create(
      :customer    => customer.id,
      :amount      => @amount,
      :description => "Booking id: #{@booking.id}",
      :currency    => 'aud'
    )


    @transaction = Transaction.create(amount: @amount, user_id: current_user.id, booking_id: @booking.id)